{"_id":"541c99f4763c32baf070586cf781ff2c73e9ef0f","isbn":"9780553588484","title":"A Game of Thrones","available":true,"amount":{"$numberInt":"9"},"sold":{"$numberInt":"1"},"categories":["fiction","fantasy"],"cover":"9780006479888.jpg","authors":["George R.R. Martin"],"coverType":"Paperback","pages":{"$numberInt":"835"},"pubDate":"1996-08-06","publisher":"Bantam","description":"Long ago, in a time forgotten, a preternatural event threw the seasons out of balance. In a land where summers can last decades and winters a lifetime, trouble is brewing. The cold is returning, and in the frozen wastes to the north of Winterfell, sinister and supernatural forces are massing beyond the kingdom’s protective Wall. At the center of the conflict lie the Starks of Winterfell, a family as harsh and unyielding as the land they were born to. Sweeping from a land of brutal cold to a distant summertime kingdom of epicurean plenty, here is a tale of lords and ladies, soldiers and sorcerers, assassins and bastards, who come together in a time of grim omens.\n\nHere an enigmatic band of warriors bear swords of no human metal; a tribe of fierce wildlings carry men off into madness; a cruel young dragon prince barters his sister to win back his throne; and a determined woman undertakes the most treacherous of journeys. Amid plots and counterplots, tragedy and betrayal, victory and terror, the fate of the Starks, their allies, and their enemies hangs perilously in the balance, as each endeavors to win that deadliest of conflicts: the game of thrones.","language":"English","price":{"$numberInt":"2040"},"rating":"","ratingsNum":""}
{"_id":"71057c910dfa54011f8d6c6688aa4737bd83c6d8","isbn":"9780008297190","title":"The Guest List","available":true,"amount":{"$numberInt":"11"},"sold":{"$numberInt":"0"},"categories":["fiction","thriller","mystery"],"cover":"9780008297190.jpg","authors":["Lucy Foley"],"coverType":"Hardback","pages":{"$numberInt":"330"},"pubDate":"2020-09-03","publisher":"HarperCollins Publishers","description":"The bride ‧ The plus one ‧ The best man ‧ The wedding planner ‧ The bridesmaid ‧ The body\n\nOn an island off the coast of Ireland, guests gather to celebrate two people joining their lives together as one. The groom: handsome and charming, a rising television star. The bride: smart and ambitious, a magazine publisher. It’s a wedding for a magazine, or for a celebrity: the designer dress, the remote location, the luxe party favors, the boutique whiskey. The cell phone service may be spotty and the waves may be rough, but every detail has been expertly planned and will be expertly executed.\n\nBut perfection is for plans, and people are all too human. As the champagne is popped and the festivities begin, resentments and petty jealousies begin to mingle with the reminiscences and well wishes. The groomsmen begin the drinking game from their school days. The bridesmaid not-so-accidentally ruins her dress. The bride’s oldest (male) friend gives an uncomfortably caring toast.\n\nAnd then someone turns up dead. Who didn’t wish the happy couple well? And perhaps more important, why?","language":"English","price":{"$numberInt":"1680"},"rating":"","ratingsNum":""}
{"_id":"b4947fec118bf436600cb0cd666e1a555e2662df","isbn":"9780062315007","title":"The Alchemist","available":true,"amount":{"$numberInt":"12"},"sold":{"$numberInt":"0"},"categories":["fiction","classic","fantasy"],"cover":"9780062355300.jpg","authors":["Paulo Coelho"],"coverType":"Paperback","pages":{"$numberInt":"175"},"pubDate":"2014-04-15","publisher":"HarperOne","description":"Combining magic, mysticism, wisdom and wonder into an inspiring tale of self-discovery, The Alchemist has become a modern classic, selling millions of copies around the world and transforming the lives of countless readers across generations.\n\nPaulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, of recognizing opportunity and learning to read the omens strewn along life's path, and, most importantly, to follow our dreams.","language":"English","price":{"$numberInt":"1560"},"rating":"","ratingsNum":""}
{"_id":"c42b50c213be96ca7b80a90f27a33ff60b951abb","isbn":"9780452284234","title":"1984","available":true,"amount":{"$numberInt":"12"},"sold":{"$numberInt":"0"},"categories":["classic","fiction","sci-fi"],"cover":"9780141036144.jpg","authors":["George Orwell"],"coverType":"Paperback","pages":{"$numberInt":"336"},"pubDate":"2008-10-01","publisher":"Penguin Books Ltd","description":"The perfect edition for any Orwell enthusiasts' collection, discover the classic dystopian masterpiece beautifully reimagined by renowned street artist Shepard Fairey\n\nWinston Smith works for the Ministry of Truth in London, chief city of Airstrip One. Big Brother stares out from every poster, the Thought Police uncover every act of betrayal. When Winston finds love with Julia, he discovers that life does not have to be dull and deadening, and awakens to new possibilities. Despite the police helicopters that hover and circle overhead, Winston and Julia begin to question the Party; they are drawn towards conspiracy. Yet Big Brother will not tolerate dissent - even in the mind. For those with original thoughts they invented Room 101. . .","language":"English","price":{"$numberInt":"1560"},"rating":"","ratingsNum":""}
{"_id":"fa36a291476d6ce88cd0c41feee4c5da04fa650c","isbn":"9781984822178","title":"Normal People","available":true,"amount":{"$numberInt":"11"},"sold":{"$numberInt":"0"},"categories":["fiction","romance"],"cover":"9780571334650.jpg","authors":["Sally Rooney"],"coverType":"Hardback","pages":{"$numberInt":"273"},"pubDate":"2019-04-16","publisher":"Hogarth Press","description":"At school Connell and Marianne pretend not to know each other. He’s popular and well-adjusted, star of the school soccer team while she is lonely, proud, and intensely private. But when Connell comes to pick his mother up from her housekeeping job at Marianne’s house, a strange and indelible connection grows between the two teenagers - one they are determined to conceal.\n\nA year later, they’re both studying at Trinity College in Dublin. Marianne has found her feet in a new social world while Connell hangs at the sidelines, shy and uncertain. Throughout their years in college, Marianne and Connell circle one another, straying toward other people and possibilities but always magnetically, irresistibly drawn back together. Then, as she veers into self-destruction and he begins to search for meaning elsewhere, each must confront how far they are willing to go to save the other.\n\nSally Rooney brings her brilliant psychological acuity and perfectly spare prose to a story that explores the subtleties of class, the electricity of first love, and the complex entanglements of family and friendship.","language":"English","price":{"$numberInt":"1680"},"rating":"","ratingsNum":""}
{"_id":"4867f26e355fbf9d41bbfb28a2b0acd9e3acde5b","isbn":"9780575079755","title":"The Lies of Locke Lamora","available":true,"amount":{"$numberInt":"11"},"sold":{"$numberInt":"0"},"categories":["fantasy","fiction","adventure"],"cover":"9780575079755.jpg","authors":["Scott Lynch"],"coverType":"Paperback","pages":{"$numberInt":"752"},"pubDate":"2006-06-27","publisher":"Orion Publishing Co","description":"An orphan’s life is harsh—and often short—in the mysterious island city of Camorr. But young Locke Lamora dodges death and slavery, becoming a thief under the tutelage of a gifted con artist. As leader of the band of light-fingered brothers known as the Gentleman Bastards, Locke is soon infamous, fooling even the underworld’s most feared ruler. But in the shadows lurks someone still more ambitious and deadly. Faced with a bloody coup that threatens to destroy everyone and everything that holds meaning in his mercenary life, Locke vows to beat the enemy at his own brutal game—or die trying.","language":"English","price":{"$numberInt":"1440"},"rating":"","ratingsNum":""}
{"_id":"d5bfd4150e23ba56f7ece2d9282e1f659659db60","isbn":"9780575079793","title":"The Blade Itself","available":true,"amount":{"$numberInt":"11"},"sold":{"$numberInt":"0"},"categories":["fantasy","fiction"],"cover":"9780575079793.jpg","authors":["Joe Abercrombie"],"coverType":"Paperback","pages":{"$numberInt":"515"},"pubDate":"2007-03-08","publisher":"Gollancz","description":"Logen Ninefingers, infamous barbarian, has finally run out of luck. Caught in one feud too many, he’s on the verge of becoming a dead barbarian – leaving nothing behind him but bad songs, dead friends, and a lot of happy enemies.\n\nNobleman Captain Jezal dan Luthar, dashing officer, and paragon of selfishness, has nothing more dangerous in mind than fleecing his friends at cards and dreaming of glory in the fencing circle. But war is brewing, and on the battlefields of the frozen North they fight by altogether bloodier rules.\n\nInquisitor Glokta, cripple turned torturer, would like nothing better than to see Jezal come home in a box. But then Glokta hates everyone: cutting treason out of the Union one confession at a time leaves little room for friendship. His latest trail of corpses may lead him right to the rotten heart of government, if he can stay alive long enough to follow it.\n\nEnter the wizard, Bayaz. A bald old man with a terrible temper and a pathetic assistant, he could be the First of the Magi, he could be a spectacular fraud, but whatever he is, he's about to make the lives of Logen, Jezal, and Glokta a whole lot more difficult.\n\nMurderous conspiracies rise to the surface, old scores are ready to be settled, and the line between hero and villain is sharp enough to draw blood.","language":"English","price":{"$numberInt":"1680"},"rating":"","ratingsNum":""}
{"_id":"0b6644c67a54575651428213e58b516f6624160f","isbn":"9781853260414","title":"The Great Gatsby","available":true,"amount":{"$numberInt":"19"},"sold":{"$numberInt":"0"},"categories":["classic","fiction","historical fiction"],"cover":"9780743273565.jpg","authors":["F. Scott Fitzgerald"],"coverType":"Paperback","pages":{"$numberInt":"180"},"pubDate":"1925-04-10","publisher":"Scribner","description":"The Great Gatsby, F. Scott Fitzgerald's third book, stands as the supreme achievement of his career. This exemplary novel of the Jazz Age has been acclaimed by generations of readers. The story of the fabulously wealthy Jay Gatsby and his love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when The New York Times noted \"gin was the national drink and sex the national obsession,\" it is an exquisitely crafted tale of America in the 1920s.","language":"English","price":{"$numberInt":"1080"},"rating":"","ratingsNum":""}
{"_id":"e7fad9d29718308a0e277a831c63d254a2a65066","isbn":"9781501139239","title":"The Seven Husbands of Evelyn Hugo","available":true,"amount":{"$numberInt":"9"},"sold":{"$numberInt":"0"},"categories":["fiction","historical fiction","romance"],"cover":"9781398515697.jpg","authors":["Taylor Jenkins Reid"],"coverType":"Hardback","pages":{"$numberInt":"389"},"pubDate":"2017-06-13","publisher":"Atria Books","description":"Aging and reclusive Hollywood movie icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. But when she chooses unknown magazine reporter Monique Grant for the job, no one is more astounded than Monique herself. Why her? Why now?\n\nMonique is not exactly on top of the world. Her husband has left her, and her professional life is going nowhere. Regardless of why Evelyn has selected her to write her biography, Monique is determined to use this opportunity to jumpstart her career.\n\nSummoned to Evelyn’s luxurious apartment, Monique listens in fascination as the actress tells her story. From making her way to Los Angeles in the 1950s to her decision to leave show business in the ‘80s, and, of course, the seven husbands along the way, Evelyn unspools a tale of ruthless ambition, unexpected friendship, and a great forbidden love. Monique begins to feel a very real connection to the legendary star, but as Evelyn’s story near its conclusion, it becomes clear that her life intersects with Monique’s own in tragic and irreversible ways.","language":"English","price":{"$numberInt":"2640"},"rating":"","ratingsNum":""}
{"_id":"950ae41491a206d99ed2815471d5d218b1d4bd67","isbn":"9780590660549","title":"Northern Lights","available":true,"amount":{"$numberInt":"20"},"sold":{"$numberInt":"0"},"categories":["fantasy"],"cover":"9781407186108.jpg","authors":["Philip Pullman"],"coverType":"Paperback","pages":{"$numberInt":"399"},"pubDate":"1995-07-01","publisher":"Scholastic Point","description":"When Lyra's friend Roger disappears, she and her dæmon, Pantalaimon, determine to find him.\n\nThe ensuing quest leads them to the bleak splendour of the North, where armoured bears rule the ice and witch-queens fly through the frozen skies - and where a team of scientists is conducting experiments too horrible to be spoken about.\n\nLyra overcomes these strange terrors, only to find something yet more perilous waiting for her - something with consequences which may even reach beyond the Northern Lights...","language":"English","price":{"$numberInt":"1560"},"rating":"","ratingsNum":""}
{"_id":"cdc7c0a99b638d26c38c79af54c614e14e3761a6","isbn":"9781408889565","title":"The Seven Deaths of Evelyn Hardcastle","available":true,"amount":{"$numberInt":"22"},"sold":{"$numberInt":"0"},"categories":["fiction","mystery","thriller","fantasy"],"cover":"9781408889510.jpg","authors":["Stuart Turton"],"coverType":"Hardback","pages":{"$numberInt":"505"},"pubDate":"2018-02-08","publisher":"Raven Books","description":"'Somebody's going to be murdered at the ball tonight. It won't appear to be a murder and so the murderer won't be caught. Rectify that injustice and I'll show you the way out.'\n\nIt is meant to be a celebration but it ends in tragedy. As fireworks explode overhead, Evelyn Hardcastle, the young and beautiful daughter of the house, is killed.\n\nBut Evelyn will not die just once. Until Aiden – one of the guests summoned to Blackheath for the party – can solve her murder, the day will repeat itself, over and over again. Every time ending with the fateful pistol shot.\n\nThe only way to break this cycle is to identify the killer. But each time the day begins again, Aiden wakes in the body of a different guest. And someone is determined to prevent him ever escaping Blackheath...","language":"English","price":{"$numberInt":"1920"},"rating":"","ratingsNum":""}
{"_id":"6642831754d68326a8daa9ca53027f44c0806c59","isbn":"9781408891384","title":"The Song of Achilles","available":true,"amount":{"$numberInt":"17"},"sold":{"$numberInt":"0"},"categories":["historical fiction","fantasy","fiction","classic"],"cover":"9781408891384.jpg","authors":["Madeline Miller"],"coverType":"Paperback","pages":{"$numberInt":"378"},"pubDate":"2012-08-28","publisher":"Ecco","description":"Achilles, \"the best of all the Greeks,\" son of the cruel sea goddess Thetis and the legendary king Peleus, is strong, swift, and beautiful, irresistible to all who meet him. Patroclus is an awkward young prince, exiled from his homeland after an act of shocking violence. Brought together by chance, they forge an inseparable bond, despite risking the gods' wrath.\n\nThey are trained by the centaur Chiron in the arts of war and medicine, but when word comes that Helen of Sparta has been kidnapped, all the heroes of Greece are called upon to lay siege to Troy in her name. Seduced by the promise of a glorious destiny, Achilles joins their cause, and torn between love and fear for his friend, Patroclus follows. Little do they know that the cruel Fates will test them both as never before and demand a terrible sacrifice. ","language":"English","price":{"$numberInt":"1800"},"rating":"4.39","ratingsNum":" — 868,074 ratings"}
{"_id":"2f7df371aa422af65a0e47cca271e256f09b8a4e","isbn":"9781250301697","title":"The Silent Patient","available":true,"amount":{"$numberInt":"25"},"sold":{"$numberInt":"0"},"categories":["thriller","mystery","fiction"],"cover":"9781409181637.jpg","authors":["Alex Michaelides"],"coverType":"Hardback","pages":{"$numberInt":"325"},"pubDate":"2019-02-05","publisher":"Celadon Books","description":"Alicia Berenson’s life is seemingly perfect. A famous painter married to an in-demand fashion photographer, she lives in a grand house with big windows overlooking a park in one of London’s most desirable areas. One evening her husband Gabriel returns home late from a fashion shoot, and Alicia shoots him five times in the face, and then never speaks another word.\n\nAlicia’s refusal to talk, or give any kind of explanation, turns a domestic tragedy into something far grander, a mystery that captures the public imagination and casts Alicia into notoriety. The price of her art skyrockets, and she, the silent patient, is hidden away from the tabloids and spotlight at the Grove, a secure forensic unit in North London.\n\nTheo Faber is a criminal psychotherapist who has waited a long time for the opportunity to work with Alicia. His determination to get her to talk and unravel the mystery of why she shot her husband takes him down a twisting path into his own motivations—a search for the truth that threatens to consume him....","language":"English","price":{"$numberInt":"1440"},"rating":"","ratingsNum":""}
{"_id":"7b1ab5dedf4e475bffd8b7150d3ff035672ea723","isbn":"9781501110368","title":"It Ends with Us","available":true,"amount":{"$numberInt":"20"},"sold":{"$numberInt":"0"},"categories":["romance","contemporary fiction","fiction"],"cover":"9781471156267.jpg","authors":["Colleen Hoover"],"coverType":"Paperback","pages":{"$numberInt":"385"},"pubDate":"2016-08-02","publisher":"Atria Books","description":"Sometimes it is the one who loves you who hurts you the most.\n\nLily hasn’t always had it easy, but that’s never stopped her from working hard for the life she wants. She’s come a long way from the small town in Maine where she grew up — she graduated from college, moved to Boston, and started her own business. So when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily’s life suddenly seems almost too good to be true.\n\nRyle is assertive, stubborn, maybe even a little arrogant. He’s also sensitive, brilliant, and has a total soft spot for Lily. And the way he looks in scrubs certainly doesn’t hurt. Lily can’t get him out of her head. But Ryle’s complete aversion to relationships is disturbing. Even as Lily finds herself becoming the exception to his “no dating” rule, she can’t help but wonder what made him that way in the first place.\n\nAs questions about her new relationship overwhelm her, so do thoughts of Atlas Corrigan — her first love and a link to the past she left behind. He was her kindred spirit, her protector. When Atlas suddenly reappears, everything Lily has built with Ryle is threatened.","language":"English","price":{"$numberInt":"3600"},"rating":"","ratingsNum":""}
{"_id":"a412e181d5f5b7e4d0a1153ee7545ed855aabb15","isbn":"9780735219113","title":"Where the Crawdads Sing","available":true,"amount":{"$numberInt":"16"},"sold":{"$numberInt":"0"},"categories":["fiction","historical fiction"],"cover":"9781472154668.jpg","authors":["Delia Owens"],"coverType":"Paperback","pages":{"$numberInt":"384"},"pubDate":"2018-08-14","publisher":"G.P. Putnam’s Sons","description":"For years, rumors of the “Marsh Girl” haunted Barkley Cove, a quiet fishing village. Kya Clark is barefoot and wild; unfit for polite society. So in late 1969, when the popular Chase Andrews is found dead, locals immediately suspect her.\n\nBut Kya is not what they say. A born naturalist with just one day of school, she takes life's lessons from the land, learning the real ways of the world from the dishonest signals of fireflies. But while she has the skills to live in solitude forever, the time comes when she yearns to be touched and loved. Drawn to two young men from town, who are each intrigued by her wild beauty, Kya opens herself to a new and startling world—until the unthinkable happens.\n\nIn Where the Crawdads Sing, Owens juxtaposes an exquisite ode to the natural world against a profound coming of age story and haunting mystery. Thought-provoking, wise, and deeply moving, Owens’s debut novel reminds us that we are forever shaped by the child within us, while also subject to the beautiful and violent secrets that nature keeps.\n\nThe story asks how isolation influences the behavior of a young woman, who like all of us, has the genetic propensity to belong to a group. The clues to the mystery are brushed into the lush habitat and natural histories of its wild creatures. ","language":"English","price":{"$numberInt":"1560"},"rating":"","ratingsNum":""}
{"_id":"a696c51b86f7a0634d52d4268c01a3a959c08a1f","isbn":"9781529029581","title":"Before the Coffee Gets Cold","available":true,"amount":{"$numberInt":"7"},"sold":{"$numberInt":"0"},"categories":["fiction","fantasy"],"cover":"9781529029581.jpg","authors":["Toshikazu Kawaguchi","Geoffrey Trousselot"],"coverType":"Paperback","pages":{"$numberInt":"213"},"pubDate":"2019-09-19","publisher":"Picador","description":"What would you change if you could go back in time?\n\nIn a small back alley in Tokyo, there is a café which has been serving carefully brewed coffee for more than one hundred years. But this coffee shop offers its customers a unique experience: the chance to travel back in time.\n\nIn Before the Coffee Gets Cold, we meet four visitors, each of whom is hoping to make use of the café’s time-travelling offer, in order to: confront the man who left them, receive a letter from their husband whose memory has been taken by early onset Alzheimer's, to see their sister one last time, and to meet the daughter they never got the chance to know.\n\nBut the journey into the past does not come without risks: customers must sit in a particular seat, they cannot leave the café, and finally, they must return to the present before the coffee gets cold . . .\n\nToshikazu Kawaguchi’s beautiful, moving story explores the age-old question: what would you change if you could travel back in time? More importantly, who would you want to meet, maybe for one last time?","language":"English","price":{"$numberInt":"1800"},"rating":"","ratingsNum":""}
{"_id":"f63de2e7157fb15a03b5f34b352d7e7230db00b1","isbn":"9781529380965","title":"The Ballad of Never After","available":true,"amount":{"$numberInt":"0"},"sold":{"$numberInt":"0"},"categories":["fantasy"],"cover":"9781529380965.jpg","authors":["Stephanie Garber"],"coverType":"Hardback","pages":{"$numberInt":"384"},"pubDate":"2022-09-13","publisher":"Hodder & Stoughton","description":"After Jacks, the Prince of Hearts, betrays her, Evangeline Fox swears she’ll never trust him again. Now that she’s discovered her own magic, Evangeline believes she can use it to restore the chance at happily ever after that Jacks stole away.\n\nBut when a new terrifying curse is revealed, Evangeline finds herself entering into a tenuous partnership with the Prince of Hearts again. Only this time, the rules have changed. Jacks isn’t the only force Evangeline needs to be wary of. In fact, he might be the only one she can trust, despite her desire to despise him.\n\nInstead of a love spell wreaking havoc on Evangeline’s life, a murderous spell has been cast. To break it, Evangeline and Jacks will have to do battle with old friends, new foes, and a magic that plays with heads and hearts. Evangeline has always trusted her heart, but this time she’s not sure she can. ","language":"English","price":{"$numberInt":"2400"},"rating":"","ratingsNum":""}
{"_id":"0260e1f6c4460b9d53d1faacab1e8abf801a486d","isbn":"9781501190100","title":"The Family Upstairs","available":true,"amount":{"$numberInt":"6"},"sold":{"$numberInt":"0"},"categories":["fiction","thriller","mystery"],"cover":"9781787461482.jpg","authors":["Lisa Jewell"],"coverType":"Hardback","pages":{"$numberInt":"340"},"pubDate":"2019-11-05","publisher":"Atria Books","description":"An alternative cover edition for this ISBN can be found here.\n\nSoon after her twenty-fifth birthday, Libby Jones returns home from work to find the letter she’s been waiting for her entire life. She rips it open with one driving thought: I am finally going to know who I am.\n\nShe soon learns not only the identity of her birth parents, but also that she is the sole inheritor of their abandoned mansion on the banks of the Thames in London’s fashionable Chelsea neighborhood, worth millions. Everything in Libby’s life is about to change. But what she can’t possibly know is that others have been waiting for this day as well—and she is on a collision course to meet them.\n\nTwenty-five years ago, police were called to 16 Cheyne Walk with reports of a baby crying. When they arrived, they found a healthy ten-month-old happily cooing in her crib in the bedroom. Downstairs in the kitchen lay three dead bodies, all dressed in black, next to a hastily scrawled note. And the four other children reported to live at Cheyne Walk were gone.\n\nThe can’t-look-away story of three entangled families living in a house with the darkest of secrets.","language":"English","price":{"$numberInt":"1680"},"rating":"","ratingsNum":""}
{"_id":"3114ebe6103ce1efbe5559d2464d571e2c7b8532","isbn":"9780062872661","title":"Blade Breaker","available":true,"amount":{"$numberInt":"15"},"sold":{"$numberInt":"0"},"categories":["fantasy"],"cover":"BladeBreaker.jpg","authors":["Victoria Aveyard"],"coverType":"Hardback","pages":{"$numberInt":"578"},"pubDate":"2022-06-28","publisher":"HarperTeen","description":"The fate of the world rests on a blade's edge.\n\nFighting beside her band of unlikely companions, Corayne is learning to embrace her ancient lineage and wield her father's powerful sword.\n\nBut while she successfully closed one of the Spindles, her journey is far from over.\n\nQueen Erida's army marches across Allward with her consort, Taristan, right beside them, opening more portals into nightmarish worlds, razing kingdoms to the ground.\n\nCorayne has no choice but to assemble an army of her own if she's to save the realm as she knows it. But perilous lands await her and the companions, and they face assassins, otherworldly beasts, and tempestuous seas all as they rally a divided Ward to fight behind them.\n\nBut Taristan has unleashed an evil far more wicked than his corpse armies. Something deadly waits in the shadows; something that might consume the world before there's any hope for victory.","language":"English","price":{"$numberInt":"2400"},"rating":"","ratingsNum":""}
{"_id":"15a5452b0a027305cec97d4352f957874cf048cf","isbn":"9781250833662","title":"Ordinary Monsters","available":true,"amount":{"$numberInt":"24"},"sold":{"$numberInt":"0"},"categories":["historical fiction","fantasy"],"cover":"monsters.jpg","authors":["J.M. Miro"],"coverType":"Hardback","pages":{"$numberInt":"672"},"pubDate":"2022-06-07","publisher":"Flatiron Books","description":"England, 1882. In Victorian London, two children with mysterious powers are hunted by a figure of darkness —a man made of smoke.\n\nSixteen-year-old Charlie Ovid, despite a lifetime of brutality, doesn't have a scar on him. His body heals itself, whether he wants it to or not. Marlowe, a foundling from a railway freight car, shines with a strange bluish light. He can melt or mend flesh. When two grizzled detectives are recruited to escort them north to safety, they are forced to confront the nature of difference, and belonging, and the shadowy edges of the monstrous.\n\nWhat follows is a journey from the gaslit streets of London, to an eerie estate outside Edinburgh, where other children with gifts—the Talents—have been gathered. Here, the world of the dead and the world of the living threaten to collide. And as secrets within the Institute unfurl, Marlowe, Charlie and the rest of the Talents will discover the truth about their abilities, and the nature of the force that is stalking them: that the worst monsters sometimes come bearing the sweetest gifts.\n\nWith lush prose, mesmerizing world-building, and a gripping plot, Ordinary Monsters presents a catastophic vision of the Victorian world—and of the gifted, broken children who must save it.","language":"English","price":{"$numberInt":"3480"},"rating":"","ratingsNum":""}
{"_id":"7aec987c588438982be52da66f642c2f958d2087","isbn":"9780593318935","title":"Nightcrawling","available":true,"amount":{"$numberInt":"22"},"sold":{"$numberInt":"0"},"categories":["fiction","contemporary fiction"],"cover":"Nightcrawling.jpg","authors":["Leila Mottley"],"coverType":"Hardback","pages":{"$numberInt":"288"},"pubDate":"2022-06-07","publisher":"Knopf Publishing Group","description":"Kiara and her brother, Marcus, are scraping by in an East Oakland apartment complex optimistically called the Regal-Hi. Both have dropped out of high school, their family fractured by death and prison. But while Marcus clings to his dream of rap stardom, Kiara hunts for work to pay their rent--which has more than doubled--and to keep the nine-year-old boy next door, abandoned by his mother, safe and fed.\n\nOne night, what begins as a drunken misunderstanding with a stranger turns into the job Kiara never imagined wanting but now desperately needs: nightcrawling. Her world breaks open even further when her name surfaces in an investigation that exposes her as a key witness in a massive scandal within the Oakland Police Department. ","language":"English","price":{"$numberInt":"3720"},"rating":"","ratingsNum":""}
{"_id":"71245a580cd80a6b2f1dd3b952c05c4637882487","isbn":"9780450040184","title":"The Shining","available":true,"amount":{"$numberInt":"28"},"sold":{"$numberInt":"2"},"categories":["thriller","horror","fiction"],"cover":"shinning.jpg","authors":["Stephen King"],"coverType":"Paperback","pages":{"$numberInt":"659"},"pubDate":"1980-07-01","publisher":"New English Library","description":"Jack Torrance's new job at the Overlook Hotel is the perfect chance for a fresh start. As the off-season caretaker at the atmospheric old hotel, he'll have plenty of time to spend reconnecting with his family and working on his writing. But as the harsh winter weather sets in, the idyllic location feels ever more remote...and more sinister. And the only one to notice the strange and terrible forces gathering around the Overlook is Danny Torrance, a uniquely gifted five-year-old.","language":"English","price":{"$numberInt":"1680"},"rating":"","ratingsNum":""}
{"_id":"a173c947f0f0f9d78100d77f5671e52edb53ae00","isbn":"9781471136726","title":"Ugly Love","available":true,"amount":{"$numberInt":"23"},"sold":{"$numberInt":"0"},"categories":["romance"],"cover":"uglyLove.jpg","authors":["Colleen Hoover"],"coverType":"Paperback","pages":{"$numberInt":"337"},"pubDate":"2014-08-05","publisher":"Atria Books","description":"When Tate Collins meets airline pilot Miles Archer, she knows it isn’t love at first sight. They wouldn’t even go so far as to consider themselves friends. The only thing Tate and Miles have in common is an undeniable mutual attraction. Once their desires are out in the open, they realize they have the perfect set-up. He doesn’t want love, she doesn’t have time for love, so that just leaves the sex. Their arrangement could be surprisingly seamless, as long as Tate can stick to the only two rules Miles has for her.\n\nNever ask about the past.\nDon’t expect a future.\n\nThey think they can handle it, but realize almost immediately they can’t handle it at all.\n\nHearts get infiltrated.\nPromises get broken.\nRules get shattered.\nLove gets ugly.","language":"English","price":{"$numberInt":"1560"},"rating":"","ratingsNum":""}
{"_id":"05086b67f61d478f918cfd09e02b238d2fe59020","isbn":"9781538724743","title":"Verity","available":true,"amount":{"$numberInt":"26"},"sold":{"$numberInt":"0"},"categories":["thriller","romance"],"cover":"verity.jpg","authors":["Colleen Hoover"],"coverType":"Paperback","pages":{"$numberInt":"336"},"pubDate":"2021-10-05","publisher":"Grand Central Publishing","description":"Lowen Ashleigh is a struggling writer on the brink of financial ruin when she accepts the job offer of a lifetime. Jeremy Crawford, husband of bestselling author Verity Crawford, has hired Lowen to complete the remaining books in a successful series his injured wife is unable to finish.\n\nLowen arrives at the Crawford home, ready to sort through years of Verity's notes and outlines, hoping to find enough material to get her started. What Lowen doesn't expect to uncover in the chaotic office is an unfinished autobiography Verity never intended for anyone to read. Page after page of bone-chilling admissions, including Verity's recollection of what really happened the day her daughter died.\n\nLowen decides to keep the manuscript hidden from Jeremy, knowing its contents would devastate the already grieving father. But as Lowen's feelings for Jeremy begin to intensify, she recognizes all the ways she could benefit if he were to read his wife's words. After all, no matter how devoted Jeremy is to his injured wife, a truth this horrifying would make it impossible for him to continue to love her.","language":"English","price":{"$numberInt":"1440"},"rating":"","ratingsNum":""}
{"_id":"4f63caf8f0458ab21e89ecd04aa6abcf7292863e","isbn":"9780141346809","title":"Percy Jackson and the Lightning Thief","available":true,"amount":{"$numberInt":"30"},"sold":{"$numberInt":"0"},"categories":["fantasy","children","adventure"],"cover":"9780141346809.jpg","authors":["Rick Riordan"],"coverType":"Paperback","pages":{"$numberInt":"377"},"pubDate":"2006-03-01","publisher":"Disney Hyperion Books","description":"Percy Jackson is a good kid, but he can't seem to focus on his schoolwork or control his temper. And lately, being away at boarding school is only getting worse - Percy could have sworn his pre-algebra teacher turned into a monster and tried to kill him. When Percy's mom finds out, she knows it's time that he knew the truth about where he came from, and that he go to the one place he'll be safe. She sends Percy to Camp Half Blood, a summer camp for demigods (on Long Island), where he learns that the father he never knew is Poseidon, God of the Sea. Soon a mystery unfolds and together with his friends—one a satyr and the other the demigod daughter of Athena - Percy sets out on a quest across the United States to reach the gates of the Underworld (located in a recording studio in Hollywood) and prevent a catastrophic war between the gods.","language":"English","price":{"$numberInt":"1560"},"rating":"","ratingsNum":""}
{"_id":"3914db74908f0623a80a05b0dd5568277067d5d4","isbn":"9780786856862","title":"The Sea of Monsters","available":true,"amount":{"$numberInt":"30"},"sold":{"$numberInt":"0"},"categories":["fantasy","children"],"cover":"theseaofmonsters.jpg","authors":["Rick Riordan"],"coverType":"Hardback","pages":{"$numberInt":"279"},"pubDate":"2006-04-01","publisher":"Hyperion Books","description":"The heroic son of Poseidon makes an action-packed comeback in the second must-read installment of Rick Riordan's amazing young readers series. Starring Percy Jackson, a \"half blood\" whose mother is human and whose father is the God of the Sea, Riordan's series combines cliffhanger adventure and Greek mythology lessons that results in true page-turners that get better with each installment.\n\nIn this episode, The Sea of Monsters, Percy sets out to retrieve the Golden Fleece before his summer camp is destroyed, surpassing the first book's drama and setting the stage for more thrills to come.","language":"English","price":{"$numberInt":"1560"},"rating":"","ratingsNum":""}
{"_id":"3e856d9698f6f065171312f363900bae17579e15","isbn":"9780141346816","title":"The Titan's Curse","available":true,"amount":{"$numberInt":"31"},"sold":{"$numberInt":"1"},"categories":["fantasy","children","fiction"],"cover":"titansCurse.jpg","authors":["Rick Riordan"],"coverType":"Paperback","pages":{"$numberInt":"320"},"pubDate":"2007-05-05","publisher":"Puffin Books","description":"It's not everyday you find yourself in combat with a half-lion, half-human.\n\nBut when you're the son of a Greek god, it happens. And now my friend Annabeth is missing, a goddess is in chains and only five half-blood heroes can join the quest to defeat the doomsday monster.\n\nOh, and guess what? The Oracle has predicted that not all of us will survive...","language":"English","price":{"$numberInt":"1440"},"rating":"4.36","ratingsNum":" — 862,028 ratings"}
{"_id":"18723411e11c1d346de47e8ec2782ed49a8fb06e","isbn":"9780141346830","title":"The Battle of the Labyrinth","available":true,"amount":{"$numberInt":"32"},"sold":{"$numberInt":"1"},"categories":["fantasy","children","fiction"],"cover":"The Battle of the Labyrinth.jpg","authors":["Rick Riordan"],"coverType":"Paperback","pages":{"$numberInt":"361"},"pubDate":"2008-03-06","publisher":"Hyperion Books for Children","description":"Percy Jackson isn't expecting freshman orientation to be any fun. But when a mysterious mortal acquaintance appears at his potential new school, followed by demon cheerleaders, things quickly move from bad to worse.\n\nIn this fourth installment of the blockbuster series, time is running out as war between the Olympians and the evil Titan lord Kronos draws near. Even the safe haven of Camp Half-Blood grows more vulnerable by the minute as Kronos's army prepares to invade its once impenetrable borders. To stop the invasion, Percy and his demigod friends must set out on a quest through the Labyrinth - a sprawling underground world with stunning surprises at every turn.","language":"English","price":{"$numberInt":"1440"},"rating":"","ratingsNum":""}
{"_id":"851fa4c8050131204bae75595e94c60985f08b67","isbn":"9780141346885","title":"The Last Olympian","available":true,"amount":{"$numberInt":"27"},"sold":{"$numberInt":"5"},"categories":["fantasy","fiction","children"],"cover":"4556058.jpg","authors":["Rick Riordan"],"coverType":"Paperback","pages":{"$numberInt":"381"},"pubDate":"2009-05-05","publisher":"Disney-Hyperion Books","description":"All year the half-bloods have been preparing for battle against the Titans, knowing the odds of victory are grim. Kronos's army is stronger than ever, and with every god and half-blood he recruits, the evil Titan's power only grows.\n\nWhile the Olympians struggle to contain the rampaging monster Typhon, Kronos begins his advance on New York City, where Mount Olympus stands virtually unguarded. Now it's up to Percy Jackson and an army of young demigods to stop the Lord of Time.\n\nIn this momentous final book in the New York Times best-selling series, the long-awaited prophecy surrounding Percy's sixteenth birthday unfolds. And as the battle for Western civilization rages on the streets of Manhattan, Percy faces a terrifying suspicion that he may be fighting against his own fate.","language":"English","price":{"$numberInt":"1440"},"rating":"","ratingsNum":""}
{"_id":"37bdab8c901364f2cbcb22aa61f4dfba2ecb7218","isbn":"9780606252560","title":"Fahrenheit 451","available":true,"amount":{"$numberInt":"15"},"sold":{"$numberInt":"0"},"categories":["classic","fiction","sci-fi","fantasy"],"cover":"13079982.jpg","authors":["Ray Bradbury"],"coverType":"Paperback","pages":{"$numberInt":"194"},"pubDate":"1953-10-19","publisher":"Turtleback Books","description":"Guy Montag is a fireman. His job is to destroy the most illegal of commodities, the printed book, along with the houses in which they are hidden. Montag never questions the destruction and ruin his actions produce, returning each day to his bland life and wife, Mildred, who spends all day with her television “family.” But when he meets an eccentric young neighbor, Clarisse, who introduces him to a past where people didn’t live in fear and to a present where one sees the world through the ideas in books instead of the mindless chatter of television, Montag begins to question everything he has ever known.","language":"English","price":{"$numberInt":"4000"},"rating":"","ratingsNum":""}
{"_id":"f201d13b4dfad3ce871329d2067ff1812f64ab52","isbn":"9780316430227 ","title":"Raising Lazarus","available":true,"amount":{"$numberInt":"3"},"sold":{"$numberInt":"0"},"categories":["political"],"cover":"59801793.jpg","authors":["Beth Macy"],"coverType":"Paperback","pages":{"$numberInt":"400"},"pubDate":"2022-08-16","publisher":"Little, Brown and Company","description":"Nearly a decade into the second wave of America's overdose crisis, pharmaceutical companies have yet to answer for the harms they created. As pending court battles against opioid makers, distributors, and retailers drag on, addiction rates have soared to record-breaking levels during the COVID pandemic, illustrating the critical need for leadership, urgency, and change. Meanwhile, there is scant consensus between law enforcement and medical leaders, nor an understanding of how to truly scale the programs that are out there, working at the ragged edge of capacity and actually saving lives.\n\nDistilling this massive, unprecedented national health crisis down to its character-driven emotional core as only she can, Beth Macy takes us into the country’s hardest hit places to witness the devastating personal costs that one-third of America's families are now being forced to shoulder. Here we meet the ordinary people fighting for the least of us with the fewest resources, from harm reductionists risking arrest to bring lifesaving care to the homeless and addicted to the activists and bereaved families pushing to hold Purdue and the Sackler family accountable. These heroes come from all walks of life; what they have in common is an up-close and personal understanding of addiction that refuses to stigmatize—and therefore abandon—people who use drugs, as big pharma execs and many politicians are all too ready to do. \n\nLike the treatment innovators she profiles, Beth Macy meets the opioid crisis where it is—not where we think it should be or wish it was. Bearing witness with clear eyes, intrepid curiosity, and unfailing empathy, she brings us the crucial next installment in the story of the defining disaster of our era, one that touches every single one of us, whether directly or indirectly. A complex story of public health, big pharma, dark money, politics, race, and class that is by turns harrowing and heartening, infuriating and inspiring, Raising Lazarus is a must-read for all Americans.","language":"English","price":{"$numberInt":"3900"},"rating":"","ratingsNum":""}
{"_id":"ed08203f6eb12d2cce52aa415fd4152c5d2a67ae","isbn":"9780063221482","title":"Breaking History: A White House Memoir","available":true,"amount":{"$numberInt":"2"},"sold":{"$numberInt":"0"},"categories":["political"],"cover":"61075755.jpg","authors":["Jared Kushner"],"coverType":"Paperback","pages":{"$numberInt":"463"},"pubDate":"2022-08-23","publisher":"HarperCollins Publishers Inc","description":"Jared Kushner was one of the most consequential presidential advisers in modern history. For the first time, he recounts what happened behind closed doors during the Trump presidency.\n\nFew White House advisors have had such an expansive portfolio or constant access to the president. From his office next to Trump, senior adviser Jared Kushner operated quietly behind the scenes, preferring to leave the turf wars and television sparring to others.\n\nNow, Kushner finally tells his story--a fast-paced and surprisingly candid account of how an earnest businessman with no political ambitions found himself pulled into a presidency that no one saw coming.\n\nBreaking History takes readers inside debates in the Oval Office, double-crosses at the United Nations, tense meetings in Arab palaces, high-stakes negotiations, and the daily barrage of leaks, false allegations, investigations, and West Wing infighting.\n\nA true historical thriller, this book is not your typical political memoir. Kushner details Washington's intense resistance to change and reveals how he broke through the stalemates of the past. An outsider among outsiders, Kushner was a results-driven executive among beltway power brokers. He questioned old assumptions and delivered unprecedented results on trade, criminal justice reform, production of COVID-19 vaccines, and Middle East peace. His successful negotiation of the Abraham Accords, the most significant diplomatic breakthrough in 50 years, earned him a nomination for the Nobel Peace Prize.\n\nWritten by one of the few people by Trump's side from his trip down the golden escalator to his final departure from Andrews Air Force Base, Breaking History provides the most honest, nuanced, and definitive understanding of a presidency that will be studied for generations.","language":"English","price":{"$numberInt":"3409"},"rating":"","ratingsNum":""}
{"_id":"9aa9ffa5cf7a6160d6fe1ee19d69850892475564","isbn":"9781788735810 ","title":"Scotland After Britain","available":true,"amount":{"$numberInt":"5"},"sold":{"$numberInt":"0"},"categories":["political"],"cover":"59893456.jpg","authors":["Neil Davidson","James Foley","Ben Wray"],"coverType":"Paperback","pages":{"$numberInt":"224"},"pubDate":"2022-08-02","publisher":"Verso Books","description":"Since the referendum, Scottish independence has been captured by conservative forces. Scotland After Britain argues for fidelity to the true meaning of the word independence. It should mean not only a break from the failing British state, but also from the prison of free trade and militarism that has delivered successive crises. Most of all, independence must honestly address the huge injustices of income, wealth and power that continue to define Scottish society, by restoring agency to working class communities and voters.\n\nScotland After Britain shines a spotlight on pro-independence politics since Brexit and the pandemic. The Scottish national question has emerged as the biggest fracture in the British state after Brexit. The independence movement emerged from mass public disenchantment at the status quo, yet the SNP continues governing as if that disenchantment never happened, and the party leadership appears increasingly ambivalent about the risks of demanding independence. Most of all, the British state remains hostile to allowing a second referendum, while the SNP leadership has been unwilling to sanction protest beyond the ballot box.\n\nWhere do we go from here? Scotland After Britain argues Brexit could force the movement to engage in a reckoning with the true stakes of independence, a process that will inevitably require a breach with the SNP’s establishment vision.","language":"English","price":{"$numberInt":"2700"},"rating":"","ratingsNum":""}
{"_id":"512f0dd91522643505b4cff0d9448fc34824f999","isbn":"9781408716045","title":"An Immigrant's Love Letter to the West","available":true,"amount":{"$numberInt":"4"},"sold":{"$numberInt":"0"},"categories":["political"],"cover":"60504972.jpg","authors":["Konstantin Kisin"],"coverType":"Paperback","pages":{"$numberInt":"288"},"pubDate":"2022-07-14","publisher":"Little, Brown Book Group","description":"For all of the West's failings - terrible food, cold weather, and questionable politicians with funny hair to name a few - it has its upsides. Konstantin would know. Growing up in the Soviet Union, he experienced first-hand the horrors of a socialist paradise gone wrong, having lived in extreme poverty with little access to even the most basic of necessities. It wasn't until he moved to the UK that Kisin found himself thriving in an open and tolerant society, receiving countless opportunities he would never have had otherwise.\n\nFunny, provocative and unswervingly perceptive, An Immigrant's Love letter to the West interrogates the developing sense of self-loathing the Western sphere has adopted and offers an alternative perspective. Exploring race politics, free speech, immigration and more, Kisin argues that wrongdoing and guilt need not pervade how we feel about the West - and Britain - today, and that despite all its ups and downs, it remains one of the best places to live in the world.\n\nAfter all, if an immigrant can't publicly profess their appreciation for this country, who can?","language":"English","price":{"$numberInt":"2500"},"rating":"","ratingsNum":""}
{"_id":"89f2b21f1714a5f7221edfc5558d09a9aa0b6cb3","isbn":"9781250796639","title":"The Viral Underclass: The Human Toll When Inequality and Disease Collide","available":true,"amount":{"$numberInt":"1"},"sold":{"$numberInt":"0"},"categories":["political"],"cover":"57693593.jpg","authors":["Steven W. Thrasher"],"coverType":"Paperback","pages":{"$numberInt":"352"},"pubDate":"2022-09-08","publisher":" St Martin's Press","description":"From preeminent LGBTQ scholar, social critic, and journalist Steven W. Thrasher comes a powerful and crucial exploration of one of the most pressing issues of our times: how viruses expose the fault lines of society.\n\nHaving spent a ground-breaking career studying the racialization, policing, and criminalization of HIV, Dr. Thrasher has come to understand a deeper truth at the heart of our society: that there are vast inequalities in who is able to survive viruses and that the ways in which viruses spread, kill, and take their toll are much more dependent on social structures than they are on biology alone.\n\nTold through the heart-rending stories of friends, activists, and teachers navigating the novel coronavirus, HIV, and other viruses, Dr. Thrasher brings the reader with him as he delves into the viral underclass and lays bare its inner workings. In the tradition of Isabel Wilkerson’s Caste and Michelle Alexander’s The New Jim Crow, The Viral Underclass helps us understand the world more deeply by showing the fraught relationship between privilege and survival.","language":"English","price":{"$numberInt":"2770"},"rating":"4.15","ratingsNum":" — 133 ratings"}
{"_id":"888cbef8670a5173617bd9caf9d7b9da56f379a4","isbn":"9780593156599","title":"The Spear Cuts Through Water","available":true,"amount":{"$numberInt":"12"},"sold":{"$numberInt":"0"},"categories":["adventure","fiction","sci-fi"],"cover":"55868456.jpg","authors":["Simon Jimenez"],"coverType":"Paperback","pages":{"$numberInt":"544"},"pubDate":"2022-08-30","publisher":"Random House Inc","description":"Two warriors shepherd an ancient god across a broken land to end the tyrannical reign of a royal family in this new epic fantasy from the author of The Vanished Birds.\n\nONE OF THE MOST ANTICIPATED BOOKS OF 2022—Tordotcom, BookPage, LitHub\n\nThe people suffer under the centuries-long rule of the Moon Throne. The royal family—the despotic emperor and his monstrous sons, the Three Terrors—hold the countryside in their choking grip. They bleed the land and oppress the citizens with the frightful powers they inherited from the god locked under their palace.\n\nBut that god cannot be contained forever.\n\nWith the aid of Jun, a guard broken by his guilt-stricken past, and Keema, an outcast fighting for his future, the god escapes from her royal captivity and flees from her own children, the triplet Terrors who would drag her back to her unholy prison. And so it is that she embarks with her young companions on a five-day pilgrimage in search of freedom—and a way to end the Moon Throne forever. The journey ahead will be more dangerous than any of them could have imagined.\n\nBoth a sweeping adventure story and an intimate exploration of identity, legacy, and belonging, The Spear Cuts Through Water is an ambitious and profound saga that will transport and transform you—and is like nothing you’ve ever read before.","language":"English","price":{"$numberInt":"4200"},"rating":"","ratingsNum":""}
{"_id":"f6266f76c6d9a2d48026812db5a3adaadbd0e815","isbn":"9780008554354","title":"Amari and the Great Game","available":true,"amount":{"$numberInt":"14"},"sold":{"$numberInt":"0"},"categories":["adventure","fiction","fantasy","children"],"cover":"53023305.jpg","authors":["B.B. Alston"],"coverType":"Hardback","pages":{"$numberInt":"400"},"pubDate":"2022-08-30","publisher":"HarperCollins Publishers","description":"Sequel to the New York Times bestseller Amari and the Night Brothers!\nArtemis Fowl meets Men in Black in this magical second book in the New York Times and Indie bestselling Supernatural Investigations trilogy—perfect for fans of Tristan Strong Punches a Hole in the Sky, the Percy Jackson series, and Nevermoor.\n\nAfter finding her brother and saving the entire supernatural world, Amari Peters is convinced her first full summer as a Junior Agent will be a breeze.\n\nBut between the fearsome new Head Minister’s strict anti-magician agenda, fierce Junior Agent rivalries, and her brother Quinton’s curse steadily worsening, Amari’s plate is full. So when the secretive League of Magicians offers her a chance to stand up for magiciankind as its new leader, she declines. She’s got enough to worry about!\n\nBut her refusal allows someone else to step forward, a magician with dangerous plans for the League. This challenge sparks the start of the Great Game, a competition to decide who will become the Night Brothers’ successor and determine the future of magiciankind.\n\nThe Great Game is both mysterious and deadly, but among the winner’s magical rewards is Quinton’s last hope—so how can Amari refuse?","language":"English","price":{"$numberInt":"2300"},"rating":"","ratingsNum":""}
{"_id":"40038a7a0cf02449ddc82be678c875d2be6e3582","isbn":"9781250841032","title":"The King Will Kill You","available":true,"amount":{"$numberInt":"21"},"sold":{"$numberInt":"0"},"categories":["adventure","romance","fantasy","children"],"cover":"58724774.jpg","authors":["Sarah Henning"],"coverType":"Hardback","pages":{"$numberInt":"368"},"pubDate":"2022-08-02","publisher":"Tor Teen","description":"Princess Amarande is finally on the verge of having everything she wants. To be with her true love Luca, no one nor law standing in the way. To rule Ardenia as queen outright, no marriage necessary, as Luca does the same with the reformed Torrence. To rebuild the continent of The Sand and Sky into a place not defined by archaic, patriarchal laws, but by the will of its people.\n\nHowever, threats await in the shadows of Amarande’s hoped-for happily ever after. One expected and deadly to both her love and every one of her objectives. The other, unexpected, and arising with a vicious aim: revenge at any cost. Against the princess who killed him, the boy whose love made her do it, and the continent cruel enough to deserve his rage.\n\nThe King Will Kill You is the epic, pulse-pounding conclusion to Sarah Henning’s Kingdoms of Sand and Sky trilogy.","language":"English","price":{"$numberInt":"3000"},"rating":"3.74","ratingsNum":" — 148 ratings"}
{"_id":"cb4d3443bb4a4c32e336aef1baed2286e2b51f95","isbn":"9780099476399","title":"Royal Escape: Gossip, scandal and an unforgettable historical adventure","available":true,"amount":{"$numberInt":"13"},"sold":{"$numberInt":"0"},"categories":["historical adventure","adventure","historical fiction","romance"],"cover":"311152.jpg","authors":["Georgette Heyer"],"coverType":"Paperback","pages":{"$numberInt":"400"},"pubDate":"2005-11-22","publisher":"Cornerstone","description":"Dispossessed of crown and kingdom, crushed and routed at the grim Battle of Worcester, the young Charles II is forced to flee for his life. Out of the heat of battle, the outlaw King and his tiny party must journey across Cromwell's England to a Channel port and a ship bound for France and safety. But the King, with his love of adventure, his irrepressible humour and his unmistakeable looks, is no easy man to hide...\n\nA typically witty, exciting and wonderful tale of historical adventure, Royal Escape will please Georgette Heyer fans old and new.","language":"English","price":{"$numberInt":"1900"},"rating":"","ratingsNum":""}
{"_id":"a42bdd7979b19130130dcb377d31c18573564942","isbn":"9781476715223","title":"The Bloody Cup","available":true,"amount":{"$numberInt":"20"},"sold":{"$numberInt":"0"},"categories":["historical adventure","historical fiction"],"cover":"18061770.jpg","authors":["M.K. Hume"],"coverType":"Paperback","pages":{"$numberInt":"512"},"pubDate":"2010-01-01","publisher":"Atria Books","description":"For many years, the people of Briton have enjoyed peace and prosperity under the reign of King Artor and the Union of Kings. Having spurned the despotism of his predecessor, Uther Pendragon, Arthur has ruled with a strong sense of duty, goodness and honour.\n\nArtor is now weakening with age, however, and the seeds of discontent are being sown. Seeking to cleanse the land of Christian belief, dissenters need a symbol with which to legitimise their pagan claim and gather malcontents together into a cohesive weapon. These shadowy, subversive elements seize upon the ancient cup of Bishop Lucius of Glastonbury as a way of fragmenting Artor's hard-fought-for kingdom. But first, they must lay their hands on the relic and, in doing so, unleash a force for evil from which murder and violent mayhem ensue.\n\nBut it emerges that the ultimate threat to Artor's rule lies far closer to home; Artor is betrayed by kin. Celt will slay Celt and the river will run with blood.","language":"English","price":{"$numberInt":"2650"},"rating":"","ratingsNum":""}
{"_id":"4140c3c93ab055a6e14a9a13354b3f33e4cdbac0","isbn":"9780345505460","title":"Sword Woman and Other Historical Adventures","available":true,"amount":{"$numberInt":"10"},"sold":{"$numberInt":"0"},"categories":["fantasy","historical fiction","historical adventure","adventure","classic"],"cover":"8484629.jpg","authors":["Robert E. Howard"],"coverType":"Paperback","pages":{"$numberInt":"576"},"pubDate":"2011-01-01","publisher":"Del Ray","description":"The immortal legacy of Robert E. Howard, creator of Conan the Cimmerian, continues with this latest compendium of Howard’s fiction and poetry. These adventures, set in medieval-era Europe and the Near East, are among the most gripping Howard ever wrote, full of pageantry, romance, and battle scenes worthy of Tolstoy himself. Most of all, they feature some of Howard’s most unusual and memorable characters, including Cormac FitzGeoffrey, a half-Irish, half-Norman man of war who follows Richard the Lion-hearted to twelfth-century Palestine—or, as it was known to the Crusaders, Outremer; Diego de Guzman, a Spaniard who visits Cairo in the guise of a Muslim on a mission of revenge; and the legendary sword woman Dark Agnès, who, faced with an arranged marriage to a brutal husband in sixteenth-century France, cuts the ceremony short with a dagger thrust and flees to forge a new identity on the battlefield.\n\nLavishly illustrated by award-winning artist John Watkiss and featuring miscellanea, informative essays, and a fascinating introduction by acclaimed historical author Scott Oden, Sword Woman and Other Historical Adventures is a must-have for every fan of Robert E. Howard, who, in a career spanning just twelve years, won a place in the pantheon of great American writers.","language":"English","price":{"$numberInt":"3700"},"rating":"","ratingsNum":""}
{"_id":"ebbb7e13302938c615f186540866c206d5f2db9c","isbn":"9781838775575","title":"Storm Tide","available":true,"amount":{"$numberInt":"13"},"sold":{"$numberInt":"0"},"categories":["historical fiction","historical adventure","adventure","fiction"],"cover":"59419108.jpg","authors":["Wilbur Smith"],"coverType":"Paperback","pages":{"$numberInt":"511"},"pubDate":"2022-04-26","publisher":"Zaffre","description":"Multimillion copy bestselling author Wilbur Smith returns with a brand-new historical epic, set against the backdrop of the American revolution.\n\nThe Courtney family is torn apart as three generations fight on opposing sides of a terrible war that will change the face of the world forever.\n\n'Best historical novelist' Stephen King\n\n'Wilbur Smith is one of those benchmarks against whom others are compared' The Times\n\n1774. Rob Courtney has spent his whole life in a quiet trading outpost on the east coast of Africa, dreaming of a life of adventure at sea. When his grandfather Jim dies, Rob takes his chance and stows away on a ship as it sails to England, with only the family heirloom, the Neptune Sword, to his name.\n\nArriving in London, Rob is seduced by the charms of the big city and soon finds himself desperate and penniless. That is until the navy comes calling and Rob is sent across the Atlantic on a ship to join the war against the rebellious American colonists.\n\nBut on the other side of the Atlantic, unbeknownst to Rob, his distant cousins Cal and Aidan Courtney are leading a campaign against the British. Their one desire is American independence, and they are determined to drive the British out of America - by whatever means necessary. . .\n\nA powerful new historical thriller by the master of adventure fiction, Wilbur Smith, of families divided and a country on the brink of revolution.","language":"English","price":{"$numberInt":"2890"},"rating":"","ratingsNum":""}
{"_id":"eed7a37db06cbbfcd6d4dc46848ee25e9ee119b7","isbn":"9781472200266","title":"The Scarlet Thief","available":true,"amount":{"$numberInt":"23"},"sold":{"$numberInt":"0"},"categories":["historical fiction","historical adventure","fiction","adventure"],"cover":"18752323.jpg","authors":["Paul Fraser Collard"],"coverType":"Paperback","pages":{"$numberInt":"352"},"pubDate":"2013-05-09","publisher":" Headline Book Publishing","description":"The new Richard Sharpe bursts onto the historical adventure scene in a brilliant, action-packed debut of Redcoat battle and bloodshed.\n\n1854: The banks of the Alma River, Crimean Peninsular. The Redcoats stagger to a bloody halt. The men of the King's Royal Fusiliers are in terrible trouble, ducking and twisting as the storm of shot, shell and bullet tear through their ranks. Officer Jack Lark has to act immediately and decisively. His life and the success of the campaign depend on it. But does he have the mettle, the officer qualities that are the life blood of the British Army? From a poor background Lark has risen through the ranks by stealth and guile and now he faces the ultimate test... THE SCARLET THIEF introduces us to a formidable and compelling hero - brutally courageous, roguish, ambitious - in a historical novel as robust as it is thrillingly authentic by an author who brings history and battle vividly alive.","language":"English","price":{"$numberInt":"2340"},"rating":"","ratingsNum":""}
{"_id":"f451068f90a8611a8a40f402543024d01f5d8306","isbn":"9780575084346","title":"The Green Mile","available":true,"amount":{"$numberInt":"23"},"sold":{"$numberInt":"0"},"categories":["horror","fantasy","fiction","thriller","mystery","crime","classic"],"cover":"9780575084346.jpg","authors":["Stephen King"],"coverType":"Paperback","pages":{"$numberInt":"592"},"pubDate":"2020-06-18","publisher":"Orion Publishing Co","description":"At Cold Mountain Penitentiary, along the lonely stretch of cells known as the Green Mile, condemned killers such as 'Billy the Kid' Wharton and the possessed Eduard Delacroix await death strapped in 'Old Sparky'. But good or evil, innocent or guilty, prisoner or guard, none has ever seen the brutal likes of the new prisoner, John Coffey, sentenced to death for raping and murdering two young girls. Is Coffey a devil in human form? Or is he a far, far different kind of being?\n\nThere are more wonders in heaven and hell than anyone at Cold Mountain can imagine and one of those wonders might just have stepped in amongst them.","language":"English","price":{"$numberInt":"1600"},"rating":"","ratingsNum":""}
{"_id":"b763eb8d0e1bc191395ae004361d56c84548b111","isbn":"9781472206244","title":"The Troop","available":true,"amount":{"$numberInt":"11"},"sold":{"$numberInt":"0"},"categories":["horror","thriller","fiction","sci-fi","mystery"],"cover":"9781472206244.jpg","authors":["Nick Cutter"],"coverType":"Hardback","pages":{"$numberInt":"358"},"pubDate":"2015-04-02","publisher":"Headline Publishing Group","description":"Once a year, scoutmaster Tim Riggs leads a troop of boys into the Canadian wilderness for a three-day camping trip; a tradition as comforting and reliable as a good ghost story and a roaring bonfire. But when an unexpected intruder -- shockingly thin, disturbingly pale, and voraciously hungry -- stumbles upon their campsite, Tim and the boys are exposed to something far more frightening than any tale of terror. The human carrier of a bioengineered nightmare. An inexplicable horror that spreads faster than fear. A harrowing struggle for survival that will pit the troop against the elements, the infected ... and one another.","language":"English","price":{"$numberInt":"1600"},"rating":"","ratingsNum":""}
{"_id":"bc46a416a0b73b480639524b1e7f8ffa709f7bf3","isbn":"9780575094161","title":"I Am Legend","available":true,"amount":{"$numberInt":"31"},"sold":{"$numberInt":"0"},"categories":["fiction","sci-fi","horror","classic","fantasy","mystery"],"cover":"9780575094161.jpg","authors":["Richard Matheson"],"coverType":"Paperback","pages":{"$numberInt":"176"},"pubDate":"2010-03-29","publisher":"Orion Publishing Co","description":"Robert Neville is the last living man on Earth... but he is not alone. Every other man, woman and child on the planet has become a vampire, and they are hungry for Neville's blood.\n\nBy day he is the hunter, stalking the undead through the ruins of civilisation. By night, he barricades himself in his home and prays for the dawn.\n\nHow long can one man survive like this?","language":"English","price":{"$numberInt":"1500"},"rating":"","ratingsNum":""}
{"_id":"8508afc8181b2018445c10c169eb3df38357969c","isbn":"9780575099999","title":"Horns","available":true,"amount":{"$numberInt":"17"},"sold":{"$numberInt":"0"},"categories":["horror","fiction","comedy","fantasy","thriller","mystery"],"cover":"6587879.jpg","authors":["Joe Hill"],"coverType":"Paperback","pages":{"$numberInt":"370"},"pubDate":"2009-03-01","publisher":"Orion Publishing Co","description":"Ignatius Perrish spent the night drunk and doing terrible things. He woke up the next morning with a thunderous hangover, a raging headache . . . and a pair of horns growing from his temples.\n\nAt first Ig thought the horns were a hallucination, the product of a mind damaged by rage and grief. He had spent the last year in a lonely, private purgatory, following the death of his beloved, Merrin Williams, who was raped and murdered under inexplicable circumstances. A mental breakdown would have been the most natural thing in the world. But there was nothing natural about the horns, which were all too real.\n\nOnce the righteous Ig had enjoyed the life of the blessed: born into privilege, the second son of a renowned musician and younger brother of a rising late-night TV star, he had security, wealth, and a place in his community. Ig had it all, and more—he had Merrin and a love founded on shared daydreams, mutual daring, and unlikely midsummer magic.\n\nBut Merrin's death damned all that. The only suspect in the crime, Ig was never charged or tried. And he was never cleared. In the court of public opinion in Gideon, New Hampshire, Ig is and always will be guilty because his rich and connected parents pulled strings to make the investigation go away. Nothing Ig can do, nothing he can say, matters. Everyone, it seems, including God, has abandoned him. Everyone, that is, but the devil inside. . . .","language":"English","price":{"$numberInt":"1469"},"rating":"","ratingsNum":""}
{"_id":"6b85b674c648ec88c6c25c82b7f887a662fd390c","isbn":"9781668002179","title":"Fairy Tale","available":true,"amount":{"$numberInt":"34"},"sold":{"$numberInt":"0"},"categories":["horror","crime","mystery","thriller","sci-fi","fantasy","fiction"],"cover":"60177373.jpg","authors":["Stephen King"],"coverType":"Hardback","pages":{"$numberInt":"608"},"pubDate":"2022-09-06","publisher":"Scribner Book Company","description":"Legendary storyteller Stephen King goes deep into the well of his imagination in this spellbinding novel about a seventeen-year-old boy who inherits the keys to a parallel world where good and evil are at war, and the stakes could not be higher—for their world or ours.\n\nCharlie Reade looks like a regular high school kid, great at baseball and football, a decent student. But he carries a heavy load. His mom was killed in a hit-and-run accident when he was ten, and grief drove his dad to drink. Charlie learned how to take care of himself—and his dad. Then, when Charlie is seventeen, he meets Howard Bowditch, a recluse with a big dog in a big house at the top of a big hill. In the backyard is a locked shed from which strange sounds emerge, as if some creature is trying to escape. When Mr. Bowditch dies, he leaves Charlie the house, a massive amount of gold, a cassette tape telling a story that is impossible to believe, and a responsibility far too massive for a boy to shoulder.\n\nBecause within the shed is a portal to another world—one whose denizens are in peril and whose monstrous leaders may destroy their own world, and ours. In this parallel universe, where two moons race across the sky, and the grand towers of a sprawling palace pierce the clouds, there are exiled princesses and princes who suffer horrific punishments; there are dungeons; there are games in which men and women must fight each other to the death for the amusement of the “Fair One.” And there is a magic sundial that can turn back time.\n\nA story as old as myth, and as startling and iconic as the rest of King’s work, Fairy Tale is about an ordinary guy forced into the hero’s role by circumstance, and it is both spectacularly suspenseful and satisfying.","language":"English","price":{"$numberInt":"4400"},"rating":"","ratingsNum":""}
{"_id":"676550066e103f5ce20d10d99ac0b96f194ae98a","isbn":"9780751584202","title":"The Ink Black Heart","available":true,"amount":{"$numberInt":"43"},"sold":{"$numberInt":"0"},"categories":["contemporary fiction","crime","thriller","mystery","romance","adventure"],"cover":"9780751584202.jpg","authors":["Robert Galbraith"],"coverType":"Hardback","pages":{"$numberInt":"1024"},"pubDate":"2022-08-30","publisher":"Little, Brown Book Group","description":"When frantic, dishevelled Edie Ledwell appears in the office begging to speak to her, private detective Robin Ellacott doesn't know quite what to make of the situation. The co-creator of a popular cartoon, The Ink Black Heart, Edie is being persecuted by a mysterious online figure who goes by the pseudonym of Anomie. Edie is desperate to uncover Anomie's true identity.\n\nRobin decides that the agency can't help with this - and thinks nothing more of it until a few days later, when she reads the shocking news that Edie has been tasered and then murdered in Highgate Cemetery, the location of The Ink Black Heart.\n\nRobin and her business partner Cormoran Strike become drawn into the quest to uncover Anomie's true identity. But with a complex web of online aliases, business interests and family conflicts to navigate, Strike and Robin find themselves embroiled in a case that stretches their powers of deduction to the limits - and which threatens them in new and horrifying ways . . .\n\nA gripping, fiendishly clever mystery, The Ink Black Heart is a true tour-de-force.","language":"English","price":{"$numberInt":"4000"},"rating":"","ratingsNum":""}
{"_id":"3ce1ff8b81e1f1dc5be2297a2ef3075aede5325c","isbn":"9781785656477","title":"If We Were Villains","available":false,"amount":{"$numberInt":"0"},"sold":{"$numberInt":"0"},"categories":["contemporary fiction","crime","thriller","mystery"],"cover":"30319086.jpg","authors":["M.L. Rio"],"coverType":"Hardback","pages":{"$numberInt":"354"},"pubDate":"2017-06-13","publisher":"Titan Books Ltd","description":"Oliver Marks has just served ten years in jail - for a murder he may or may not have committed. On the day he's released, he's greeted by the man who put him in prison. Detective Colborne is retiring, but before he does, he wants to know what really happened a decade ago.\n\nAs one of seven young actors studying Shakespeare at an elite arts college, Oliver and his friends play the same roles onstage and off: hero, villain, tyrant, temptress, ingenue, extra. But when the casting changes, and the secondary characters usurp the stars, the plays spill dangerously over into life, and one of them is found dead. The rest face their greatest acting challenge yet: convincing the police, and themselves, that they are blameless.","language":"English","price":{"$numberInt":"1799"},"rating":"","ratingsNum":""}
{"_id":"4accef82257d3a2e70eb54a4dd09eb0ef6545559","isbn":"9780140167771","title":"The Secret History","available":true,"amount":{"$numberInt":"18"},"sold":{"$numberInt":"0"},"categories":["contemporary fiction","mystery","thriller","crime","fiction","classic"],"cover":"9780140167771.jpg","authors":["Donna Tartt"],"coverType":"Paperback","pages":{"$numberInt":"640"},"pubDate":"1995-07-01","publisher":"Penguin Books Ltd","description":"'Everything, somehow, fit together; some sly and benevolent Providence was revealing itself by degrees and I felt myself trembling on the brink of a fabulous discovery, as though any morning it was all going to come together---my future, my past, the whole of my life---and I was going to sit up in bed like a thunderbolt and say oh! oh! oh!'\n\nUnder the influence of a charismatic classics professor, a group of clever, eccentric misfits at a New England college discover a way of thought and life a world away from their banal contemporaries. But their search for the transcendent leads them down a dangerous path, beyond human constructs of morality.","language":"English","price":{"$numberInt":"1899"},"rating":"","ratingsNum":""}
{"_id":"ec3c871d943fcf2616b6c8234df5fda6dfe24438","isbn":"9781509858637","title":"This is Going to Hurt: Secret Diaries of a Junior Doctor","available":true,"amount":{"$numberInt":"12"},"sold":{"$numberInt":"0"},"categories":["comedy"],"cover":"35510008.jpg","authors":["Adam Kay"],"coverType":"Paperback","pages":{"$numberInt":"304"},"pubDate":"2018-04-19","publisher":"Pan Macmillan","description":"Welcome to the life of a junior doctor: 97-hour weeks, life and death decisions, a constant tsunami of bodily fluids, and the hospital parking meter earns more than you.\nScribbled in secret after endless days, sleepless nights and missed weekends, Adam Kay's This is Going to Hurt provides a no-holds-barred account of his time on the NHS front line. Hilarious, horrifying and heartbreaking, this diary is everything you wanted to know – and more than a few things you didn't – about life on and off the hospital ward.","language":"English","price":{"$numberInt":"1800"},"rating":"","ratingsNum":""}
{"_id":"35fc49afb940fbb4d9c4cdc0f68cabc145791ace","isbn":"9781847399304","title":"The Bro Code","available":true,"amount":{"$numberInt":"12"},"sold":{"$numberInt":"0"},"categories":["comedy"],"cover":"4725669.jpg","authors":["Matt Kuhn","Matt Kuhn"],"coverType":"Paperback","pages":{"$numberInt":"195"},"pubDate":"2008-10-14","publisher":"Simon & Schuster Ltd","description":"Everyone's life is governed by an internal code of conduct. Some call it morality. Others call it religion. But Bros in the know call this holy grail the Bro Code.\n\nHistorically a spoken tradition passed from one generation to the next, the official code of conduct for Bros appears here in its published form for the first time ever. By upholding the tenets of this sacred and legendary document, any dude can learn to achieve Bro-dom.","language":"English","price":{"$numberInt":"1445"},"rating":"","ratingsNum":""}
{"_id":"8cfcfac04c0d0043e6cd7c5f531a7c0f180e1833","isbn":"9781473635302","title":"Born a Crime: Stories From a South African Childhood","available":true,"amount":{"$numberInt":"12"},"sold":{"$numberInt":"0"},"categories":["comedy"],"cover":"29780253.jpg","authors":["Trevor Noah"],"coverType":"Hardback","pages":{"$numberInt":"289"},"pubDate":"2017-09-21","publisher":"John Murray Publishers Ltd","description":"The memoir of one man’s coming-of-age, set during the twilight of apartheid and the tumultuous days of freedom that followed.\n\nTrevor Noah’s unlikely path from apartheid South Africa to the desk of The Daily Show began with a criminal act: his birth. Trevor was born to a white Swiss father and a black Xhosa mother at a time when such a union was punishable by five years in prison. Living proof of his parents’ indiscretion, Trevor was kept mostly indoors for the earliest years of his life, bound by the extreme and often absurd measures his mother took to hide him from a government that could, at any moment, steal him away. Finally liberated by the end of South Africa’s tyrannical white rule, Trevor and his mother set forth on a grand adventure, living openly and freely and embracing the opportunities won by a centuries-long struggle.\n\nBorn a Crime is the story of a mischievous young boy who grows into a restless young man as he struggles to find himself in a world where he was never supposed to exist. It is also the story of that young man’s relationship with his fearless, rebellious, and fervently religious mother—his teammate, a woman determined to save her son from the cycle of poverty, violence, and abuse that would ultimately threaten her own life.","language":"English","price":{"$numberInt":"1599"},"rating":"","ratingsNum":""}
{"_id":"2e1805506cd7a6d084ddfbc2e87bf4885dc36fcc","isbn":"9781444775815","title":"A Man Called Ove","available":true,"amount":{"$numberInt":"12"},"sold":{"$numberInt":"0"},"categories":["comedy","contemporary fiction"],"cover":"18774964.jpg","authors":["Fredrik Backman"],"coverType":"Hardback","pages":{"$numberInt":"337"},"pubDate":"2012-08-27","publisher":"Hodder & Stoughton","description":"A grumpy yet loveable man finds his solitary world turned on its head when a boisterous young family moves in next door.\n\nMeet Ove. He's a curmudgeon, the kind of man who points at people he dislikes as if they were burglars caught outside his bedroom window. He has staunch principles, strict routines, and a short fuse. People call him the bitter neighbor from hell, but must Ove be bitter just because he doesn't walk around with a smile plastered to his face all the time?\n\nBehind the cranky exterior there is a story and a sadness. So when one November morning a chatty young couple with two chatty young daughters move in next door and accidentally flatten Ove's mailbox, it is the lead-in to a comical and heartwarming tale of unkempt cats, unexpected friendship, and the ancient art of backing up a U-Haul. All of which will change one cranky old man and a local residents' association to their very foundations.","language":"English","price":{"$numberInt":"1300"},"rating":"","ratingsNum":""}
{"_id":"02f468ccea087a66d1a5d21f3def1e2518cc9a54","isbn":"9781542025607","title":"Reminders of Him","available":true,"amount":{"$numberInt":"10"},"sold":{"$numberInt":"0"},"categories":["contemporary fiction","romance","drama"],"cover":"58341222.jpg","authors":["Colleen Hoover"],"coverType":"Paperback","pages":{"$numberInt":"335"},"pubDate":"2022-01-18","publisher":"Amazon Publishing","description":"A troubled young mother yearns for a shot at redemption in this heartbreaking yet hopeful story from #1 New York Times bestselling author Colleen Hoover. After serving five years in prison for a tragic mistake, Kenna Rowan returns to the town where it all went wrong, hoping to reunite with her four-year-old daughter. But the bridges Kenna burned are proving impossible to rebuild. Everyone in her daughter’s life is determined to shut Kenna out, no matter how hard she works to prove herself. The only person who hasn’t closed the door on her completely is Ledger Ward, a local bar owner and one of the few remaining links to Kenna’s daughter. But if anyone were to discover how Ledger is slowly becoming an important part of Kenna’s life, both would risk losing the trust of everyone important to them. The two form a connection despite the pressure surrounding them, but as their romance grows, so does the risk. Kenna must find a way to absolve the mistakes of her past in order to build a future out of hope and healing.","language":"English","price":{"$numberInt":"2500"},"rating":"","ratingsNum":""}
{"_id":"3d52072d67f29554d2d32364479492ca3fcb902b","isbn":"9786068754994","title":"Heart Bones","available":true,"amount":{"$numberInt":"12"},"sold":{"$numberInt":"0"},"categories":["drama","contemporary fiction","romance"],"cover":"51007311.jpg","authors":["Colleen Hoover"],"coverType":"Paperback","pages":{"$numberInt":"338"},"pubDate":"2020-08-19","publisher":"EPICA","description":"Life and a dismal last name are the only two things Beyah Grim's parents ever gave her. After carving her path all on her own, Beyah is well on her way to bigger and better things, thanks to no one but herself.\n\nWith only two short months separating her from the future she's built and the past she desperately wants to leave behind, an unexpected death leaves Beyah with no place to go during the interim. Forced to reach out to her last resort, Beyah has to spend the remainder of her summer on a peninsula in Texas with a father she barely knows. Beyah's plan is to keep her head down and let the summer slip by seamlessly, but her new neighbor Samson throws a wrench in that plan.\n\nSamson and Beyah have nothing in common on the surface.\n\nShe comes from a life of poverty and neglect; he comes from a family of wealth and privilege. But one thing they do have in common is that they're both drawn to sad things. Which means they're drawn to each other. With an almost immediate connection too intense for them to continue denying, Beyah and Samson agree to stay in the shallow end of a summer fling. What Beyah doesn't realize is that a rip current is coming, and it's about to drag her heart out to sea.","language":"English","price":{"$numberInt":"1899"},"rating":"","ratingsNum":""}
{"_id":"7c9bc4066f68c5638700e56b9152e79f81946ba6","isbn":"9781542016421","title":"Regretting You","available":true,"amount":{"$numberInt":"10"},"sold":{"$numberInt":"0"},"categories":["drama","romance","contemporary fiction"],"cover":"44582454.jpg","authors":["Colleen Hoover"],"coverType":"Paperback","pages":{"$numberInt":"363"},"pubDate":"2019-12-10","publisher":"Amazon Publishing","description":"Morgan Grant and her sixteen-year-old daughter, Clara, would like nothing more than to be nothing alike.\n\nMorgan is determined to prevent her daughter from making the same mistakes she did. By getting pregnant and married way too young, Morgan put her own dreams on hold. Clara doesn’t want to follow in her mother’s footsteps. Her predictable mother doesn’t have a spontaneous bone in her body.\n\nWith warring personalities and conflicting goals, Morgan and Clara find it increasingly difficult to coexist. The only person who can bring peace to the household is Chris—Morgan’s husband, Clara’s father, and the family anchor. But that peace is shattered when Chris is involved in a tragic and questionable accident. The heartbreaking and long-lasting consequences will reach far beyond just Morgan and Clara.\n\nWhile struggling to rebuild everything that crashed around them, Morgan finds comfort in the last person she expects to, and Clara turns to the one boy she’s been forbidden to see. With each passing day, new secrets, resentment, and misunderstandings make mother and daughter fall further apart. So far apart, it might be impossible for them to ever fall back together.","language":"English","price":{"$numberInt":"2599"},"rating":"","ratingsNum":""}
{"_id":"c0cf1de11bc6ce904f76c0bce877a253aea783cc","isbn":"9781398519732","title":"All Your Perfects","available":true,"amount":{"$numberInt":"12"},"sold":{"$numberInt":"0"},"categories":["drama","romance","contemporary fiction"],"cover":"38926487.jpg","authors":["Colleen Hoover"],"coverType":"Paperback","pages":{"$numberInt":"305"},"pubDate":"2018-07-17","publisher":"Simon & Schuster Ltd","description":"Colleen Hoover delivers a tour de force novel about a troubled marriage and the one old forgotten promise that might be able to save it.\n\nQuinn and Graham’s perfect love is threatened by their imperfect marriage. The memories, mistakes, and secrets that they have built up over the years are now tearing them apart. The one thing that could save them might also be the very thing that pushes their marriage beyond the point of repair.\n\nAll Your Perfects is a profound novel about a damaged couple whose potential future hinges on promises made in the past. This is a heartbreaking page-turner that asks: Can a resounding love with a perfect beginning survive a lifetime between two imperfect people?","language":"English","price":{"$numberInt":"1500"},"rating":"","ratingsNum":""}
{"_id":"8ff30243d2b95f7fd0cff3f76c37320081f8bd46","isbn":"9780008538774","title":"All Good People Here","available":true,"amount":{"$numberInt":"13"},"sold":{"$numberInt":"0"},"categories":["drama","romance","mystery","thriller","fiction","crime"],"cover":"60142750.jpg","authors":["Ashley Flowers"],"coverType":"Paperback","pages":{"$numberInt":"320"},"pubDate":"2022-08-16","publisher":"HarperCollins Publishers","description":"In the propulsive debut novel from the host of the #1 true crime podcast \"Crime Junkie,\" a journalist uncovers her hometown’s dark secrets when she becomes obsessed with the unsolved murder of her childhood neighbor—and the disappearance of another girl twenty years later.\n\nEveryone from Wakarusa, Indiana, remembers the case of January Jacobs, who was found dead in a ditch hours after her family awoke to find her gone. Margot Davies was six at the time, the same age as January—and they were next-door neighbors. In the twenty years since, Margot has grown up, moved away, and become a big-city journalist, but she’s always been haunted by the fear that it could’ve been her. And the worst part is, January’s killer has never been brought to justice.\n\nWhen Margot returns home to help care for her sick uncle, it feels like walking into a time capsule. Wakarusa is exactly how she remembered: genial, stifled, secretive. Then news breaks about five-year-old Natalie Clark from the next town over, who’s gone missing under eerily similar circumstances. With all the old feelings rushing back, Margot vows to find Natalie and solve January’s murder once and for all.\n\nBut the police, the family, the townspeople—they all seem to be hiding something. And the deeper Margot digs into Natalie’s disappearance, the more resistance she encounters, and the colder January’s case feels. Could the killer still be out there? Could it be the same person who kidnapped Natalie? And what will it cost to finally discover what truly happened that night?","language":"English","price":{"$numberInt":"2399"},"rating":"","ratingsNum":""}
